workstation/openfoam-master-tutorials/tutorials/lagrangian/reactingParcelFoam/counterFlowFlame2DLTS/constant/reactions
species
(
    O2
    H2O
    CH4
    CO2
    N2
);

reactions
{
    methaneReaction
    {
        type     irreversibleArrheniusReaction;
        reaction "CH4 + 2O2 = CO2 + 2H2O";
        A        5.2e16;
        beta     0;
        Ta       14906;
    }
}
